---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallTopIsAttached
source: html/f6d153d9-6fa2-75a9-12c3-0d05473c7fb5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallTopIsAttached Property

"Top is Attached"

## Syntax (C#)
```csharp
public static ForgeTypeId WallTopIsAttached { get; }
```